{
  "home": "Home",
  "shop": "Shop",
  "language": "Language",
  "aboutme": {
    "title": "About me",
    "content": "Hello! That guy up there is me :). Well, my name is Vinicius and I am a \"program boy\" since 2019, but all my interested in this beautiful work area comes since I'm young, when I had my own Minecraft server, all begins with me just editing some YAML files, but with time I got limited in terms of the functionality to my server, then after a little google time I found a plugin called \"Skript\" that lets me create mini plugins to my server, the logical structure of it was pretty similar to Python's, but after a while the same problem comes to me, Skript it was really good, but again I got limited with the functionalities, then I decided to learn Java and started to do my own plugin and that's when I fell in love with language and with development."
  },
  "projects": {
    "title": "Projects",
    "description": "So, that's my projects and I'm proud of each of them! I'm a very Harry Potter's fan guy, sou will be normal see a lot of references of it :). All my API's can be tested by yourself, you just have to get an access token that will be valid for 2 hours by clicking in the button bellow and be free to test any of my API's by clicking on \"documentation\" button.",
    "tokenbutton": "Access Token",
    "canvas": {
      "title": "Get an Access Token",
      "description": "To get an access token is pretty easy. All you have to do is fill the form bellow and we will send you a token to your e-email, your token will be valid for 2 (two) hours. Don't worry, I won't use your informations for nothing, this is just to keep sure that my API's will not be used other than testing.",
      "form": {
        "name": "Your name:",
        "nameplaceholder": "Enter with your name",
        "email": "Email:",
        "emailplaceholder": "Enter with your email",
        "notemailsharing": "We'll never share your email with anyone else.",
        "submit": "Submit"
      }
    },
    "buckbeakweb": {
      "title": "Buckbeak Web",
      "tech": "React",
      "content": "This project was created with intention to use as a potfolio for me, in this project I'm using the React library with Typescript and to the language switcher I'm using i18next library.",
      "moreinfo": "More informations in the links bellow",
      "github": "Github",
      "documentation": "Demonstration"
    },
    "naginiapi": {
      "title": "Nagini Api",
      "tech": "Golang",
      "content": "This project was created with the intention of simulating a real e-commerce API scenario, it was used the teconology Golang with the framework Fiber and to save datas, it was used the MySQL.",
      "moreinfo": "More informations in the links bellow",
      "github": "Github",
      "documentation": "Documentation"
    },
    "naginiweb": {
      "title": "Nagini Web",
      "tech": "React",
      "content": "This project was created with the intention of simulating a real e-commerce, it was used React library with Typescript.",
      "moreinfo": "More informations in the links bellow",
      "github": "Github",
      "documentation": "Demonstration"
    }
  }
}